Repository: 84000/data-translation-memory
Catalog: toh381_84000-emergence-from-samputa.tmx
Source language: bo
Languages: en

source: །བླ་མའི་མན་ངག་ལམ་གྱིས་ནི།
en: “This path relies on the guru’s instructions

source: །ཡེ་ཤེས་རྣམ་ཤེས་ངོ་བོ་ལས།
en: As it involves the nature of gnosis-consciousness.

source: །མཚན་ཉིད་བསྟན་བཅོས་མདོར་བསྡུས་པ།
en: Its properties are indicated in treatises;

source: །དེ་ཉིད་དཔའ་བོ་སྟོན་པ་པོ།
en: Its reality, however, is pointed out by the valiant instructor.

source: །འདི་ཡི་བསྒོམ་པ་ཐམས་ཅད་ཀྱི།
en: “He should always visualize it

source: །འོད་ཟེར་དཀར་པོས་རྣམ་པར་བརྒྱན།
en: As engulfed in white light, And imagine it with the other seed syllables of the ambrosias,

source: །ལྕགས་སྒྲོག་ལྔ་པོ་མཆོད་རྟེན་གྱི།
en: In a stūpa with five layers.

source: །བདུད་རྩིའི་ས་བོན་བསམས་ནས་ནི། །ཁ་དོག་དཀར་པོ་འོད་གསལ་བ།
en: “The bodhicitta drop, sublime with the glow of white light,

source: །བདུད་རྩིའི་རྒྱུན་ནི་འཛག་པར་འགྱུར།
en: Overflows with a stream of ambrosia.

source: །སྙིང་གི་ས་བོན་པད་དབུས་སུ།
en: At the heart, in the center of the lotus containing the syllables,

source: །མཐེ་བོང་ཡོངས་ཀྱི་དཀྱིལ་འཁོར་འདི།
en: Is an orb the size of a thumb.

source: །དེ་ཡི་དབུས་སུ་ས་བོན་ནི།
en: “In its center there are syllables

source: །ཨཱ་ལི་ཀཱ་ལི་ཡོངས་བཏུས་པ།
en: Embodying all vowels and consonants,

source: །ཟླ་བའི་འོད་ཟེར་འཕྲོ་བ་ནི།
en: Emitting rays of moonlight.

source: །དེ་ཡི་དབུས་སུ་སྒོ་རྣམས་ཀྱི།
en: “At the openings in their center

source: །ཐིག་ལེ་བསམ་པར་རབ་ཏུ་གྲགས།
en: There is a drop, consisting of what is known as consciousness,

source: །སྐྲ་ཡི་རྩེ་མོ་བརྒྱ་ཆར་ནི།
en: As fine as one hundredth of a hair tip,

source: །ཕྲ་རབ་གཟུགས་སུ་ཡང་དག་གནས།
en: In the form of an infinitesimally small particle.

source: །རྣམ་པར་ཤེས་པའི་རང་བཞིན་ལས།
en: “Since it is the nature of the consciousness

source: །ཡེ་ཤེས་ཅན་གྱི་མཚན་ཉིད་མཚོན།
en: Of those who cognize objects and their properties,

source: །གོ་འཕང་གནས་ཀྱི་ཐིག་ལེ་ལྟོས།
en: Look into the state of abiding as the drop— It is characterized by non-perception and non-thought.

source: །སེམས་ཀྱི་མཚན་ཉིད་ཐམས་ཅད་ཤེས།
en: “The consciousness-gnosis may be grasped By relying on the guru’s instructions Regarding the descent of the drop

source: །སྙིང་ལ་ཚངས་པའི་སྒོ་ཡི་ནི། །ཐིག་ལེ་སྒོ་ཡི་ལམ་ལས་ནི། །བླ་མའི་མན་ངག་བརྩོན་པ་ཡིས། །རྣམ་ཤེས་ཡེ་ཤེས་ཀྱི་ཡང་བླང་།
en: From the opening at the fontanel down to the heart.

source: །ལམ་གྱི་ཕྱི་རོལ་བསྟན་བཅོས་ཀྱང་།
en: “The outsiders will not find the right path,

source: །མ་ཡིན་རིང་བར་འགྱུར་བ་ཡིན།
en: Which is difficult to find even with the aid of treatises.

source: །བསྟན་བཅོས་རྣམས་ནི་རྙེད་སླ་ཡང་།
en: Such treatises are easy to find,

source: །སྦྱོར་བ་དེ་ལ་རྙེད་པར་དཀའ།
en: But the practices described therein are difficult to discern. “He should eagerly follow the guru’s instructions,

source: །རྣལ་འབྱོར་པ་ཡི་ཐབས་ཀྱིས་ནི། །བླ་མ་གསོལ་བ་འདེབས་ལ་བརྩོན།
en: Applying the methods used by yogins.

source: །རྣམ་པར་མཁས་པས་མཐོང་བར་འགྱུར།
en: Will be able to discern the practices described in treatises.

source: །མཉམ་གཞག་དངོས་པོའི་རང་བཞིན་གྱིས།
en: “Fully collected, he should meditate merging with the essence,

source: །གཡོ་བ་མེད་ཅིང་འཚེ་བ་མེད།
en: Unwavering and untroubled.

source: །ཡིད་ནི་ཆོས་རྣམས་སྔོན་དུ་འགྲོ།
en: Phenomena are preceded by the mind;

source: །ཡིད་ནི་དག་ཅིང་ཡིད་ལྟར་མགྱོགས།
en: They are purified by mind and have the swiftness of thought.

source: །ཡིད་ཀྱི་རྒྱལ་པོའི་བཀའ་དྲིན་གྱིས།
en: “It is through the mind, with its king-like grace,

source: །སྨྲ་བ་དང་ནི་བྱེད་པར་འགྱུར།
en: That one speaks and acts.

source: །དེ་ཕྱིར་ཡིད་ཀྱི་བདག་ཉིད་ཀུན།
en: Thus, with everything being the nature of mind,

source: །ཡིད་ལ་བྱུང་བར་བློ་ལྡན་པས།
en: The wise one knows that he is born from mind. “The yogin should recite the mantra as he likes,

source: །སྙིང་གར་སེམས་བསྒོམ་སྡོམ་པ་ནི། །གལ་ཏེ་འདོད་ན་ཡོ་གིས་བཟླས། །རྒྱུ་རུ་གྱུར་པའི་ས་བོན་ཏེ།
en: Keeping his attention on his heart,

source: །དེ་ཉིད་དཔྱད་པས་མ་ཡིན་ནོ།
en: For it is not the principal natures that

source: །འབྲས་བུ་རྒྱུ་ཡི་ས་བོན་ཏེ།
en: Constitute the cause, but the seed syllables. “Since the seed syllables comprise cause and effect,

source: །དེ་ཉིད་མཐོང་བ་མ་ཡིན་ནོ།
en: The principal natures should not be viewed as such. The five syllables to be visualized are

source: །གཟུགས་སོགས་སྲིད་པའི་ལོངས་སྤྱོད་ཀྱིས། །དམིགས་པའི་ས་བོན་རྣམ་པ་ལྔ། །སྤྱི་བོ་སྤྱི་མེད་ཡང་དག་གནས།
en: The fivefold experience of existence, of form, and so forth.

source: །ཀུན་ནས་ཀུན་དུ་འབབ་པར་འགྱུར།
en: “As he is carried around everywhere, He should place these syllables in the central channel. Thus the syllables of gnosis and cognition should be placed

source: །རྟག་ཏུ་རྩ་བའི་ས་བོན་གྱི།
en: At the roots of the three channels that always need to be blocked.

source: །ཡེ་ཤེས་རྣམ་ཤེས་ས་བོན་ལས།
en: “When he longs for experiences of saṃsāra, He should join these syllables, in mental recitation,

source: །ཐིག་ལེ་སྒྲ་དང་ཡང་དག་ལྡན། །འཁོར་བའི་ལོངས་སྤྱོད་འདོད་པ་ཡིས། །ཡིད་ཀྱི་བཟླས་པ་ཡང་དག་ལྡན།
en: With the ‘sound’ and the ‘drop’ ,

source: །ཡི་གེ་ངག་ནི་རྣམ་པར་སྤངས།
en: Without, however, saying them aloud.

source: །ངེས་པར་རྟག་ཏུ་གོ་འཕང་གནས།
en: “He will definitively and perpetually

source: །རྟག་པ་དང་ནི་ཆོས་ཀྱི་དབྱིངས།
en: Come to abide, together with the buddhas,

source: །རྟག་ཏུ་ཕྲ་ཞིང་སྐྱོན་མེད་པ།
en: In the state that is always subtle and stainless,

source: །ཡེ་ཤེས་ལ་ནི་རྣམ་ཤེས་ནུབ།
en: And where gnosis and cognition merge.

source: །ཡེ་ཤེས་དངོས་པོས་རྣམ་ཤེས་ཀྱི།
en: “With its presence as gnosis, cognition may

source: །རྫོགས་པའི་བྱང་ཆུབ་རིམ་མཐོང་འགྱུར།
en: Then be observed in its progression toward perfect awakening.

source: །དང་པོར་མཚན་མ་ཐམས་ཅད་ཀྱི།
en: The first sign to be observed

source: །མར་མེའི་རྣམ་པ་མཐོང་བར་འགྱུར།
en: For all practitioners is the form of a bright flame.

source: །གཉིས་པ་མཚན་མོ་མེ་ཁྱེར་གྱི།
en: “The second sign revealed

source: །རྣམ་པའི་རྡུལ་ནི་མཚོན་པར་བྱེད།
en: Is sparkling dust resembling fireflies—

source: །རྡུལ་དཀར་ཙ་ན་ཀ་དབྱིབས་སུ། །ཕྱོགས་བཅུར་དེ་བཞིན་མཐོང་བར་འགྱུར།
en: It will be seen as circular shapes of white powder Formed throughout the ten direction.

source: །གསུམ་པར་ཉོན་མོངས་བཅོམ་པ་ནི། །རྣལ་འབྱོར་པ་ཡིས་རྣམ་པར་བརྟགས།
en: “The third sign observed by practitioners

source: །ལྷ་ཡི་ལོངས་སྤྱོད་འདོད་པ་ཡང་།
en: Is the disappearance of afflictions.

source: །བཞི་པར་ཡང་ནི་བསྟན་པའོ།
en: The fourth one to be revealed

source: །ལྷ་ཡི་གཟུགས་ནི་ཐམས་ཅད་ཀྱང་།
en: Is the experience of the pleasures of gods from the desire realm.

source: །ལྔ་པར་སེམས་ཀྱིས་བརྟག་པར་བྱ།
en: “The fifth sign mentally perceived Is the experience of the delights of the form realm,

source: །དྲུག་པ་གཟུགས་ནི་མེད་པའི་ཆ།
en: The sixth is the pleasures of the formless realm,

source: །བདུན་པ་ཆོས་ཀྱི་དབྱིངས་ཉིད་དེ།
en: And the seventh is those experienced by the buddhas.

source: །བརྒྱད་པར་རང་འདོད་རྣལ་འབྱོར་པའི།
en: “With the arrival of the eighth sign, practitioners

source: །སངས་རྒྱས་རྣམས་ཀྱི་འབྲས་བུའི་དོན།
en: Can experience at will the fruition that is the goal of awakening.

source: །རྡོ་རྗེ་སེམས་དཔའ་སྙིང་རྗེ་ཆེ།
en: “Listen, O most compassionate Vajrasattva,

source: །ངེས་པར་དངོས་པོ་ཐམས་ཅད་ཀྱི།
en: “Definitely all things are known

source: །དག་པ་དེ་བཞིན་ཉིད་དུ་བརྗོད།
en: To possess purity as their essence.

source: །ཕྱིས་ནི་རེ་རེར་དབྱེ་བ་ཡིས། །ལྷ་རྣམས་ཀྱི་ནི་བརྗོད་པར་བྱ།
en: Subsequent to this, the deities are explained, One by one, according to their divisions.

source: །ལུས་ཅན་རྣམས་ཀྱི་ཕུང་པོ་དང་། །ཁམས་རྣམས་དང་ནི་སྐྱེ་མཆེད་རྣམས།
en: “The aggregates, elements, and sense-fields

source: །རང་བཞིན་གྱིས་ནི་རྣམ་པར་དག །ཉོན་མོངས་མི་ཤེས་སྒྲིབ་སྦྱང་བྱ།
en: Of embodied beings are pure by nature. Though veiled by ignorance and afflictions, they can be purified.

source: །རང་རིག་བདག་ཉིད་དག་པ་ཉིད།
en: Being the nature of one’s own awakening, they are themselves pure,

source: །དག་པ་གཞན་གྱིས་རྣམ་གྲོལ་མིན།
en: Such that one is not liberated through some extrinsic purity.

source: །ཡུལ་གྱི་དངོས་པོ་དག་པའི་ཕྱིར།
en: “With the purity of sense objects,

source: །རང་གིས་རིག་པའི་བདེ་བ་མཆོག །གཟུགས་ལ་སོགས་པའི་ཡུལ་གང་དང་། །གཞན་ཡང་རྣལ་འབྱོར་པ་སྣང་བ།
en: Self-reflexive awareness is the ultimate bliss. Objects of form, and so forth, And whatever else appears to practitioners,

source: །དེ་ཀུན་རང་བཞིན་དག་པ་སྟེ།
en: “Are all pure by nature,

source: །དེ་ཕྱིར་སངས་རྒྱས་སྣ་ཚོགས་དངོས།
en: For everything is comprised of wakefulness.”

source: །ཀྱེ་བཅོམ་ལྡན་འདས་རྣམ་པར་མ་དག་པ་གང་ལགས།
en: Vajragarbha asked, “O Blessed One, what are the things that are impure?”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གཟུགས་ལ་སོགས་པའོ།
en: The Blessed One said, “They are form, and so forth.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why are they impure? Because they involve apprehended object and apprehending subject.”

source: གཟུང་བ་དང་འཛིན་པའི་ཕྱིར་རོ། །གསོལ་པ། གཟུང་བ་དང་འཛིན་པ་གང་ལགས།
en: Vajragarbha then asked, “Well, what then are apprehended object and apprehending subject?”

source: མིག་གིས་གཟུགས་ནི་གཟུང་བར་བྱ།
en: “Form is apprehended by the eye;

source: །སྒྲ་ནི་རྣ་བས་མཉན་པར་བྱ།
en: Sound, by the ear;

source: །དྲི་ནི་སྣ་ཡིས་ཚོར་བར་བྱ། །ལྕེ་ཡིས་རོ་ནི་རིག་པར་བྱ།
en: Odors, by the nose; And taste, by the tongue.

source: །ལུས་ཀྱིས་དངོས་པོ་རིག་པར་བྱ།
en: “A physical object is felt by the body

source: །ཡིད་ཀྱིས་བདེ་སོགས་ཐོབ་པ་ནི།
en: And the mind apprehends happiness, and so forth.

source: །དག་པས་དུག་མེད་བྱས་ནས་ནི། །བསྟེན་བྱ་འདི་དག་བསྟེན་པར་བྱ།
en: These sense objects ought to be enjoyed After purifying them by removing poison.

source: །གཟུགས་ནི་སངས་རྒྱས་རྣམ་སྣང་མཛད།
en: “Form is Buddha Vairocana,

source: །ཚོར་བ་རྡོ་རྗེ་ཉི་མ་སྟེ།
en: Sensation is Vajrasūrya

source: །འདུ་ཤེས་པདྨ་གར་དབང་ཕྱུག །དེ་བཞིན་འདུ་བྱེད་རྡོ་རྗེ་རྒྱལ།
en: Perception is Padmanarteśvara, Predispositions are Vajrarāja,

source: །རྣམ་ཤེས་རྡོ་རྗེ་སེམས་དཔའ་ཉིད།
en: “Consciousness is Vajrasattva—

source: །ཀུན་གྱི་ངོ་བོ་ཧེ་རུ་ཀ།
en: The inherent nature of everything is Heruka.

source: །མིག་ལ་གཏི་མུག་རྡོ་རྗེ་བཤད།
en: The eye is called Mohavajra;

source: །ཞེ་སྡང་རྡོ་རྗེ་མངོན་ཐོས་པ།
en: The ear has the name Dveṣavajra.

source: །ཕྲག་དོག་རྡོ་རྗེ་དེ་བཞིན་སྣ།
en: “Īrṣyāvajra is the nose,

source: །ཁ་ནི་འདོད་ཆགས་རྡོ་རྗེར་བཤད།
en: Rāgavajra is the mouth,

source: །རེག་ལ་སེར་སྣ་རྡོ་རྗེ་མ།
en: Mātsaryavajra is touch,

source: །ཁམས་དང་སྐྱེ་མཆེད་ཐམས་ཅད་ནི། །དམ་པའི་དབང་ཕྱུག་ཧེ་རུ་ཀ།
en: And Heruka, the supreme lord, is all the sensory fields and elements.

source: །ས་ཡི་ཁམས་ནི་ལྟུང་བྱེད་མ།
en: “Pātanī is the element of earth;

source: །ཆུ་ཁམས་གསོད་པར་བྱེད་མར་བརྗོད།
en: The element of water is known as Māraṇī.

source: །མེ་ཡི་ཁམས་ནི་འགུགས་བྱེད་མ།
en: Ākarṣaṇī is the element of fire;

source: །དེ་བཞིན་རླུང་ནི་གར་དབང་ཕྱུག །ནམ་མཁའི་ཁམས་སུ་བརྗོད་པ་ནི།
en: The element of wind is Narteśvarī. “The element of space is said to be

source: །པདྨ་འབར་བ་འཁྱིལ་པ་ཉིད།
en: Padmajvālinī, because of her imperturbability.

source: །འདི་ལྟར་ལུས་ཅན་རྣམས་ཀྱི་ལུས།
en: In this way the bodies of embodied beings—

source: །ཕུང་པོ་ལ་སོགས་ལྷ་བདག་ཉིད།
en: Their aggregates, and so forth—have the nature of deities.

source: །བདེ་དང་སྡུག་བསྔལ་དེ་བཞིན་ལས།
en: “Pleasure and pain, and acting on them,

source: །ཉོན་མོངས་ལ་སོགས་དེས་བསྐྱེད་པའི།
en: Generate afflictive emotions, and the rest—

source: །བསྐྱེད་པའི་ཆ་ལ་ལེགས་གནས་པས།
en: Following one’s lot resulting from this generation,

source: །སྲིད་དང་མྱ་ངན་འདས་པ་ཐོབ།
en: One will incur either cyclic existence or its cessation.”

source: །ཕུང་པོ་དང་སྐྱེ་མཆེད་རྣམ་པར་དག་པ་སྟེ་ལྔ་པ་ལས་རབ་ཏུ་བྱེད་པ་གཉིས་པའོ།།
en: This concludes the second part of the fifth chapter on the purity of the aggregates, and so forth.

source: །།དེ་ནས་སྤྱོད་པས་རྟོག་པ་རྣམས།
en: “Now, the right practice, which destroys

source: །འཇིག་པར་བྱེད་པ་བཤད་པར་བྱེད།
en: The enemy, conceptual thinking, will be explained;

source: །ཆོས་རྣམས་ཀུན་ལ་མཉམ་བྱུང་བ།
en: Distilled from the totality of Buddha’s teachings,

source: །དེ་ཉིད་སྤྱོད་པ་གོང་ན་མེད།
en: This practice of reality is supreme.

source: །སངས་རྒྱས་སྲས་ལ་ཕན་པའི་ཕྱིར།
en: “For the sake of the Buddha’s sons,

source: །རྫོགས་པའི་བྱང་ཆུབ་རྣམ་གནས་པ།
en: Who are established in perfect awakening, This practice, the ultimate Perfection of Wisdom, Will be truthfully explained by Anaṅgavajra. “Like a boat safely sailing on,

source: །གང་ཞིག་ཡང་ནི་དེ་ཉིད་ལས། །རྡོ་རྗེ་ཡན་ལག་མེད་པ་ཡི།
en: She delivers all beings

source: །ཤེས་རབ་ཕ་རོལ་ཕྱིན་པ་མཆོག །སྐྱེ་བའི་རྒྱ་མཚོ་འཇིགས་ཆེན་པོར།
en: From the terrifying ocean of births,

source: །རྒ་བའི་རླབས་ཀྱིས་འཁྲུགས་པ་ལས། །སེམས་ཅན་ཐམས་ཅད་སྒྲོལ་བར་བྱེད།
en: Rough with the waves of old age, and so forth.

source: །ཚོང་པ་དགེ་བར་འགྲོ་བ་དང་། །མྱུར་དུ་དངོས་གྲུབ་གསལ་བྱེད་ཅིང་།
en: “She, the divine one, quickly brings accomplishment,

source: །སྙིང་པོའི་ཡོན་ཏན་ཀུན་གྱི་གནས།
en: Being an essential receptacle of all good qualities.

source: །སེམས་ཀྱི་རིན་ཆེན་ལས་བྱུང་བ།
en: Manifested from the jewel of the mind,

source: །འདོད་དོན་རབ་ཏུ་སྒྲུབ་པར་བྱེད།
en: She fulfills everyone’s desired aim.

source: །རྡོ་རྗེ་འཛིན་པས་རབ་བསྔགས་པའི།
en: “Since without her, who is praised by Vajradhara

source: །ལོངས་སྤྱོད་རྫོགས་པའི་ཡོན་ཏན་ཀུན། །ལུས་བྱུང་འདི་ལས་མ་གཏོགས་པར།
en: And constitutes the body of qualities of all the perfectly awakened ones,

source: །དགའ་བའི་དངོས་གྲུབ་འབྱུང་མི་འགྱུར།
en: Accomplishment is not possible, the wise ones who desire liberation

source: །མཁས་མཆོག་སྤྱོད་པ་མཚུངས་མེད་འདི། །གྲོལ་བར་འདོད་པས་སྤྱད་པར་གྱིས།
en: Should perform this unequaled practice. “The lotuses of her feet are worshiped by Viṣṇu, Indra,

source: །ལྷ་ཡི་དགྲ་དང་བརྒྱ་བྱིན་དང་། །གྲོང་ཁྱེར་སུམ་བརྩེགས་དགྲ་བོ་དང་། །ནོར་སྦྱིན་ཚངས་པ་ལ་སོགས་པས།
en: Śiva Mahādeva, Kubera, Brahmā, and so forth.

source: །ཞབས་ཀྱི་འདམ་སྐྱེས་མཆོད་པ་ཡིས། །སྡིག་པ་འཇིག་བྱེད་འདི་ལ་སྤྱོད།
en: By doing this practice that removes sin,

source: །མྱུར་དུ་དེ་བཞིན་གཤེགས་པ་ཡི། །གནས་ཀྱི་མཆོག་ནི་ཐོབ་པར་འགྱུར།
en: The tathāgatas swiftly attained the ultimate state. “This practice of the central channel has been taught

source: །དཔལ་ལྡན་རྡོ་རྗེ་སེམས་དཔས་ནི། །གང་ཞིག་འགྲོ་ལ་ཕན་པར་ནི།
en: By the glorious Vajrasattva for the benefit of the world.

source: །ཀུན་འདར་གྱི་ནི་སྤྱོད་པ་གསུངས།
en: “Accordingly, the practitioner should cultivate

source: །དེ་ལྟར་མཆོག་ཏུ་བསམ་ཡས་གནས། །ཤིན་ཏུ་གསང་བ་ཡོ་གིས་བསྒོམ།
en: This sublime inconceivable state in great secrecy. He should engage in this samaya practice

source: །རྟོག་པ་ཐམས་ཅད་བྲལ་བར་ནི།
en: While free of all concepts.

source: །དམ་ཚིག་ལ་ནི་སྤྱད་པར་བྱ།
en: “In the initial stage, the practitioner should abide

source: །རྒྱུ་མཐུན་འབྲས་བུ་རང་བཞིན་ལས། །དང་པོའི་རྩོམ་པར་ཡོ་གི་གནས།
en: With the natural outflow of the existing condition.

source: །དེ་ནས་བསྒོམས་པས་དུབ་པ་ན།
en: Then, should he tire from meditation,

source: །བསྡུས་ནས་བྱིས་པའི་རྩེ་བར་བྱ།
en: He should take a break, adopting the playfulness of a child.

source: །སྣ་ཚོགས་གདུལ་བྱའི་འཇིག་རྟེན་ལ།
en: “For the sake of different types of people who require guidance,

source: །འཇམ་པའི་གཟུགས་ཅན་རང་ཉིད་བསྒོམ།
en: He should visualize himself in the gentle form of Mañjuśrī.

source: །གྲུབ་པར་གྲགས་པ་མ་ལུས་པ།
en: “Everything known as accomplishment comes about through

source: །ཅི་གསུངས་རྣམ་པ་སྣ་ཚོགས་པའི།
en: Different practices accordingly taught;

source: །སྤྱོད་པས་བླ་ན་མེད་པ་ཡི།
en: there is, however, an unexcelled practice

source: །ཀུན་བཟང་མཚུངས་པ་མེད་འགྲུབ་པས།
en: That brings about the unparalleled accomplishment of Samantabhadra—

source: །སྤྱོད་པ་ངེས་རིག་རྡོ་རྗེ་ཅན། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་ཏོ།
en: It is this practice that the Blessed Vajrasattva has taught. “Always paying homage to his protector,

source: །དཔལ་ལྡན་སློབ་དཔོན་རྡོ་རྗེ་ཅན། །ཀུན་གྱི་མགོན་ལ་ཕྱག་འཚལ་ལོ།
en: The glorious vajra master,

source: །གསང་བའི་སྤྱོད་པས་གནས་ནས་ནི།
en: He should rely on the secret practice,

source: །བློ་གྲོས་ཆེན་པོ་བྱ་བ་བྱས།
en: Doing what needs to be done and maintaining a noble heart.

source: །དེ་ནས་རང་གི་འདོད་སྒྱུར་བས།
en: “Then, following his inclinations

source: །སྦྱོར་བ་ཀུན་ལ་ཁ་ཕྱིར་བལྟས།
en: While turning away from all attachments, He should comport himself while in touch with reality,

source: །ཀུན་ཏུ་སེང་གེ་ལྟ་བུར་ནི།
en: In every respect like a lion.

source: །དེ་ཉིད་ལྡན་པས་བདག་གིས་སྤྱད།
en: “Through perfectly knowing things as they are,

source: །ཇི་ལྟར་བྱུང་དོན་ཡང་དག་རིག །འགྲོ་བ་འདོན་པའི་བསམ་པ་ཡིས།
en: And thus forming the intention to deliver the world, He comes to embody full mastery of the correct view,

source: །ཡང་དག་ལྟ་བ་རབ་སྒྱུར་བདག །བརྟན་པའི་སེམས་ནི་གནས་མེད་པས།
en: With a steadfast mind free of reference points.

source: །ཕུང་པོ་ཁམས་སོགས་མཚན་ཉིད་ནི།
en: “All attributes such as the aggregates, elements,

source: །ཐམས་ཅད་རྨི་ལམ་སྒྱུ་མ་ལྟར།
en: And so forth are like a dream and an illusion.

source: །ཁམས་གསུམ་འདི་དག་ཐམས་ཅད་ནི།
en: Knowing the entire triple universe

source: །མདོར་བསྡུས་ནས་ནི་འདིར་ཤེས་བྱ།
en: To be, in short, like this, “He should associate with those

source: །སྒྲིབ་པ་ཀུན་ལས་རྣམ་པར་གྲོལ།
en: Who live free from all obscurations, Casting far away

source: །འཚོ་བར་དབང་ཕྱུག་འདུ་བ་དང་། །དེ་བཞིན་འཇིག་རྟེན་ཆོས་བརྒྱད་ནི། །ཐམས་ཅད་ཤིན་ཏུ་རིང་དུ་སྤངས།
en: All the eight worldly concerns.

source: །རྟག་ཏུ་རྟོག་པ་མེད་གྱུར་པས།
en: “Always free of concepts,

source: །གཉིས་སུ་མེད་པར་ངེས་བྱས་ནས།
en: He should gain certainty about the nondual state,

source: །ཕ་རོལ་ཕྱིན་དྲུག་རྣལ་འབྱོར་གྱིས།
en: And apply the six perfections

source: །སངས་རྒྱས་དངོས་གྲུབ་རབ་གྲུབ་ཕྱིར།
en: In order to attain the accomplishment of an awakened one.

source: །སེམས་ཅན་དོན་ལ་ལེགས་ནུས་ཀྱང་།
en: “Although eminently engaged for the welfare of beings,

source: །སེམས་ཅན་ཡོངས་སུ་བརྟག་མི་བྱ།
en: He should not form concepts about them.

source: །བྱང་ཆུབ་ལ་ནི་སེམས་བཞག་ནས།
en: He should set his mind on awakening

source: །ཕྱོགས་ལས་རྒྱལ་བའི་སྤྱོད་པ་བརྩམ།
en: And embark on the practice of conquering the directions.

source: །ཐབས་དང་ཤེས་རབ་ལྡན་པའི་བདག །སྦྱོར་བ་ཀུན་ལ་རྒྱབ་ཀྱིས་ཕྱོགས།
en: “Being the embodiment of wisdom and means conjoined,

source: །དེ་ཉིད་གོམས་པར་རབ་བྱས་པས།
en: And turning away from all attachments,

source: །སྐྱེ་བ་འདིར་ནི་འགྲུབ་པར་འགྱུར།
en: He will succeed even in this lifetime If he exerts himself in the cultivation of true reality.

source: །རྟོག་པ་ཀུན་ལས་རྣམ་པར་གྲོལ།
en: “Free of all concepts and, in particular,

source: །སེམས་ཅན་བསམ་པའི་ཁྱད་པར་ལས།
en: Of ideas about other beings, He should enjoy anything at all, applying the understanding

source: །སྒྱུ་མ་ལྟར་སོགས་རྣལ་འབྱོར་གྱིས། །ཐམས་ཅད་ཉིད་ནི་བཟའ་བར་བྱ།
en: That things are like an illusion, and so forth.

source: །ཆོས་ཀྱི་དབྱིངས་ལས་ཡང་དག་བྱུང་།
en: “Having arisen from the undifferentiated sphere of phenomena,

source: །གང་ཡང་ཀུན་ཏུ་ལམ་གྲོགས་མེད།
en: No beings can become his adversaries. He should enjoy things as he pleases

source: །དོགས་པ་མེད་པའི་སེམས་ཀྱིས་ནི། །ཇི་ལྟར་འདོད་པར་རབ་ཏུ་བཟའ།
en: With a mindset free of hesitation.

source: །ལོངས་སྤྱོད་རྫོགས་དོན་འདི་དག་ཀུན།
en: “All this is for the sake of enjoyment—

source: །ཁམས་གསུམ་དག་ནི་མ་ལུས་པ།
en: This entire triple universe, Conjured up by Vajrasattva

source: །སྒྲུབ་པ་པོ་ལ་ཕན་པའི་ཕྱིར། །རྡོ་རྗེ་སེམས་དཔས་རྣམ་པར་སྤྲུལ།
en: For practitioners’ benefit.

source: །ཡེ་ཤེས་མཐའ་ཡས་ཐོབ་པ་ཡིས།
en: “If, by attaining infinite gnosis,

source: །དེ་བཞིན་གཤེགས་ཕྱག་མི་བྱ་ན།
en: He does not need to worship the tathāgatas,

source: །རྟག་ཏུ་སྒོམ་པ་ལྡན་པ་ཡིས། །དབང་བསྐུར་མེད་སོགས་སྨོས་ཅི་དགོས།
en: What need is there to mention initiations, and so forth, For him constantly engaged in meditation?

source: །བྱང་ཆུབ་སེམས་ཀྱི་རང་བཞིན་ལས།
en: “The nature of all objects

source: །དངོས་པོ་ཀུན་གྱི་རང་བཞིན་འདི།
en: Is the nature of awakened mind.

source: །དེ་ཉིད་བཅོམ་ལྡན་རྡོ་རྗེ་ཅན།
en: That alone is the Blessed One, the vajra holder.

source: །དེ་ཕྱིར་དེ་ཉིད་ལྷ་རྣམས་ཉིད།
en: Therefore, that alone is the identity of the deities.

source: །དཀྱིལ་འཁོར་སྨྱུང་བ་མི་བྱ་ཞིང་།
en: “Neither maṇḍalas nor fasts are to be performed,

source: །ཕྱག་རྒྱ་མཆོད་རྟེན་ལས་མི་བྱ།
en: Nor the formation of gestures or caityas.

source: །དཔལ་ལྡན་རྡོ་རྗེ་མགོན་པོས་ནི། །གང་ཡང་གཞན་དུ་བསྟན་པ་རྣམས།
en: Also other things Taught by the glorious vajra lord

source: །ལྷག་པར་མོས་པས་གནས་གང་ཡང་།
en: Out of his great dedication—

source: །དེ་རྣམས་ཀྱིས་ཀྱང་དེ་ཉིད་རིག །ཇི་ལྟར་བདུད་རྩིའི་དོན་གཉེར་བས།
en: Of what use would they be to he who knows reality? “Just as one who seeks ambrosia

source: །སྙིང་པོ་བླངས་ནས་དོར་བ་སྤོང་།
en: Should discard the buttermilk after taking the fresh butter,

source: །དེ་ལྟར་ཆོས་ཀྱི་སྙིང་པོ་ནི།
en: So should he discard all thoughts

source: །ཐོབ་ནས་རྟོག་པ་ཐམས་ཅད་སྤངས།
en: After obtaining the ambrosia of Dharma.

source: །རྟོག་མེད་གང་ཚེ་བློ་ལྡན་པས།
en: “When the wise practitioner is without concepts,

source: །དོགས་པ་སྤངས་ཤིང་གནས་མེད་པ།
en: Has given up doubt, and is free of reference points,

source: །ཐུགས་ཀྱི་རྡོ་རྗེ་ཅི་གསུངས་བཞིན།
en: Then, just as Vajra Mind has said,

source: །དེ་ཚེ་འགྲུབ་འགྱུར་ཐེ་ཚོམ་མེད།
en: There is no doubt he will succeed.

source: །རྟོག་པས་དམྱལ་བར་འགྲོ་འགྱུར་ཏེ།
en: “Because of concepts, he will go to hell

source: །འགྲོ་བ་དྲུག་གི་འཁོར་བ་ཡི། །རྒྱ་མཚོ་རུ་ནི་འཁོར་བར་འགྱུར།
en: And wander in the ocean of cyclic existence, with its six destinies.

source: །རྟོག་པ་མེད་ན་གྲོལ་འགྱུར་ཞིང་།
en: But free from concepts, he will be liberated,

source: །གནས་ནི་དྲི་མེད་ཞི་བ་ཉིད།
en: Reaching the state of stainless tranquility.

source: །དེ་ཕྱིར་རྟོག་པའི་དགྲ་གཞོམ་ཕྱིར། །དམ་ཚིག་སངས་རྒྱས་མཛད་པ་གང་།
en: “Therefore, in order to destroy the net of concepts

source: །དེ་ནི་རྟག་ཏུ་གོམས་པར་བྱ།
en: He should regularly practice the samaya observances, Which were performed by the awakened one,

source: །གང་གིས་དམ་ཚིག་གནས་གྱུར་པ།
en: Abiding by them wherever he may be.

source: །སྔགས་ཤེས་བསམ་པའི་ནུས་པས་བྱ།
en: “They should be performed by someone who knows mantra,

source: །དངོས་པོ་ཀུན་ལ་བལྟ་བར་བྱ།
en: Without excessive attachment, but not eschewing anything.

source: །ངེས་པར་ཐམས་ཅད་མ་སྐྱེས་པའི།
en: They all without exception should be regarded

source: །རྣམ་པ་ཡི་ནི་རྣལ་འབྱོར་གྱིས།
en: By applying the understanding of the non-arising of forms.

source: །ཁྱི་དང་བོང་བུ་རྔ་མོ་དང་། །གླང་པོ་ལ་སོགས་ཁྲག་འཐུངས་ནས།
en: “He should drink the blood of dogs, donkeys, camels, elephants, and so on,

source: །ཤ་ཡང་རྟག་ཏུ་བཟའ་བ་ཉིད།
en: And eat their meat regularly.

source: །ཤ་ཆེན་ཁྲག་གིས་བསྒོས་པ་ནི།
en: Human meat smeared with blood

source: །ཐམས་ཅད་ཁྱད་པར་དུ་ནི་བལྟ།
en: Should be regarded as the best of all.

source: །དམན་པའི་ཤ་ནི་ཐམས་ཅད་དང་། །སྲོག་ཆགས་འབུམ་ཕྲག་བརྒྱ་ལྡན་བཟའ།
en: “He should eat all kinds of poor meats, And the excellent meats containing hundreds of thousands of living creatures.

source: །རྣམ་སྣང་ཤིན་ཏུ་རུལ་བ་ཡི།
en: The practitioner should also eat terribly putrid feces

source: །སྲིན་བུ་བརྒྱ་ཕྲག་ཟི་ཟིར་ལྡན།
en: Swarming with hundreds of worms, “And keenly relish meat

source: །ཁྱི་དང་མི་སྐྱུགས་བསྲེས་ནས་ནི།
en: Mixed with dog and human vomit,

source: །ཤ་ནི་རྡོ་རྗེའི་ཆུས་གོས་ལྡན། །རྣལ་འབྱོར་པས་ནི་སྤྲོ་བ་ཡིས།
en: Dowsed with vajra water, covered in flies,

source: །རྣམ་སྣང་བསྲེས་ནས་བཟའ་བར་བྱ།
en: And blended with feces.

source: །རྡོ་རྗེའི་ཆུ་ནི་བཏུང་བར་བྱ།
en: “He should drink vajra water.

source: །གང་གི་ཚེ་འགའ་ཞིག་ཏུ་ཤའི་བཟའ་བ་མ་རྙེད་ན་བཟའ་བའི་དོན་དུ་ཤའི་གཟུགས་སུ་རྣམ་པར་བརྟགས་ཏེ་བཟའོ།
en: When meat cannot be found anywhere, in order to partake of it he should imagine something else in the form of meat and eat that.

source: །གང་ཞིག་གཞན་པའི་འཇིག་རྟེན་ཟ་བ་དེ་བཟའ་བར་བྱའོ།
en: “Foodstuffs inedible to others are edible for the master of the true state. Places improper to visit are fine for him to visit.

source: །དེ་ཁོ་ནའི་སྒྲུབ་པ་པོའི་དབང་པོ་གང་ཞིག་བགྲོད་པར་བྱ་བ་མ་ཡིན་པ་དེ་ལ་བགྲོད་པར་བྱ་བ་དང་། གང་ཞིག་བྱ་བ་མ་ཡིན་པ་དེ་ནི་དེའི་བྱ་བ་དང་། བགྲོད་པ་དང་བགྲོད་པར་བྱ་བ་མ་ཡིན་པར་རྣམ་པར་རྟོག་པ་དང་། བཟའ་བ་དང་བཟའ་བར་བྱ་བ་མ་ཡིན་པ་དང་། སྡུག་པ་དང་མི་སྡུག་པ་དང་། བཏུང་བ་དང་བཏུང་བ་མ་ཡིན་པར་སྔགས་པས་མི་བྱ་སྟེ།
en: Things improper to do are proper for him. The follower of the mantra path must not think in terms of ‘fit to visit’ and ‘unfit to visit’; ‘edible’ and ‘inedible’; ‘desirable’ and ‘undesirable’; or ‘drinkable’ and ‘undrinkable.’
